//*****************************************************************************
//  debugモジュール
//  author: 中島将浩
//  update: 2014/05/13
//*****************************************************************************
#ifndef _DEBUG_H_
#define _DEBUG_H_

#include "main.h"
#include <d3dx9.h>

#include "renderer.h"

//*****************************************************************************
//  constant
//*****************************************************************************
#define _DEBUG_HIT_DRAW_

//*****************************************************************************
//  class
//*****************************************************************************
class Renderer;

class Debug{
public:
	//*****************************************************************************
	//【コンストラクタ】
	//  引数: なし
	//*****************************************************************************
	Debug(){}


	//*****************************************************************************
	//【デス様】
	//  あとかたづけ
	//  引数: なし
	//*****************************************************************************
	virtual ~Debug(){}

	//*****************************************************************************
	//【初期化】
	//  バッファクリア、フォントの取得
	//  返り値: 初期化に成功したかどうか
	//  引数: なし
	//*****************************************************************************
	static HRESULT SetUp(void);

	//*****************************************************************************
	//【終了】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	static void Release(void);

	//*****************************************************************************
	//【出力】
	//  返り値: なし
	//  第1引数: 文字列
	//  第2引数: 可変長引数
	//*****************************************************************************
	static void Print(char* format, ...);

	//*****************************************************************************
	//【描画】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	static void Draw(void);

	//accessor
	static void SetRenderer(Renderer *renderer){Debug::_renderer = renderer;}

	static void EntryHitView(D3DXVECTOR3 pos, float radius);


private:
	static void LoadHitView(void);
	static void ReleaseHitView(void);

	static const int BUFFER_MAX = 1024;

	static Renderer *_renderer;
	static char _buffer[BUFFER_MAX];
	static LPD3DXFONT _font;					// フォントへのポインタ

	static int _mesh_id;			//頂点バッファのポインタ

	struct HIT_VIEW{
		D3DXVECTOR3 position;
		float radius;
		bool flag;
	};

	static const int HIT_VIEW_MAX = 128;
	static HIT_VIEW _hit_view[HIT_VIEW_MAX];

};

//accessor

#endif//_DEBUG_H_