//*****************************************************************************
//  スキンメッシュ用頂点シェーダ
//  author: 中島将浩
//  update: 2015/12/03
//*****************************************************************************
#ifndef _VS_SKIN_MESH_H_
#define _VS_SKIN_MESH_H_

#include "vertex_shader.h"
#include "renderer.h"

//*****************************************************************************
//  constant
//*****************************************************************************

//*****************************************************************************
//  class
//*****************************************************************************
class Renderer;
class VSSkinMesh : public VertexShader{
private:
	VSSkinMesh(){}
public:

	//*****************************************************************************
	//【コンストラクタ】
	//  頂点バッファNULL詰めなど
	//  引数: なし
	//*****************************************************************************
	VSSkinMesh(Renderer *master_renderer);

	//*****************************************************************************
	//【デス様】
	//  あとかたづけ
	//  引数: なし
	//*****************************************************************************
	virtual ~VSSkinMesh();

	virtual void Set(void);

	//accessor
	virtual void SetWorldArray(D3DXMATRIX* value, int length);

protected:
	D3DXMATRIX _world_array[Renderer::BONE_TABLE_MAX];
};

//accessor

#endif//_VERTEX_SHADER_H_