//*****************************************************************************
//  scene_billboardモジュール
//  author: 中島将浩
//  update: 2014/05/07
//*****************************************************************************
#ifndef _SCENE_BILLBOARD_H_
#define _SCENE_BILLBOARD_H_

#include "main.h"
#include "object.h"

//*****************************************************************************
//  constant
//*****************************************************************************

//*****************************************************************************
//  class
//*****************************************************************************
class ObjectBillboard : public Object{
public:

	//*****************************************************************************
	//【コンストラクタ】
	//  頂点バッファNULL詰めなど
	//  引数: なし
	//*****************************************************************************
	ObjectBillboard(Renderer *master_renderer, int layer_no = Object::DRAW_LAYER_BILLBOARD);

	//*****************************************************************************
	//【デス様】
	//  あとかたづけ
	//  引数: なし
	//*****************************************************************************
	virtual ~ObjectBillboard(){
		Release();
	}

	//*****************************************************************************
	//【初期設定】
	//  返り値: 設定に成功したかどうか
	//  第1引数: 中心位置
	//  第2引数: 横幅
	//  第3引数: 縦幅
	//  第4引数: テクスチャパス
	//*****************************************************************************
	HRESULT SetUp(D3DXVECTOR3 pos, float width, float height, char *texture_filename);

	//*****************************************************************************
	//【終了】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	virtual void Release(void);

	//*****************************************************************************
	//【更新】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	virtual void Update(void);

	//*****************************************************************************
	//【描画】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	virtual void Draw(void);

	//*****************************************************************************
	//【頂点バッファのUV値設定】
	//  返り値: なし
	//  引数: なし
	//*****************************************************************************
	void SetUV(float left, float top, float right, float bottom);


	void SetRectSize(D3DXVECTOR2 size){ _size.x = size.x; _size.y = size.y; }
	void SetScale(D3DXVECTOR2 scale){_scale = scale;}
	//accessor
	void SetOffset(D3DXVECTOR3 offset){_offset = offset;}
	void SetOffsetX(float value){_offset.x = value;}
	void SetOffsetY(float value){_offset.y = value;}
	void SetOffsetZ(float value){_offset.z = value;}
private:
	LPDIRECT3DVERTEXBUFFER9 _vtx;			//頂点バッファのポインタ
	int _texture_id;
	LPDIRECT3DVERTEXDECLARATION9 _decl;

	D3DXVECTOR2 _scale;
	
	D3DXVECTOR3 _offset;
};

//accessor

#endif//_SCENE_BILLBOARD_H_