//*****************************************************************************
//  フィールド描画用クラス
//  とりあえず片っ端から描画するけど、のちにインスタンシングに切り替える
//  author: 中島将浩
//  update: 2016/02/26
//*****************************************************************************
#ifndef _TILE_FIELD_IMAGE_H_
#define _TILE_FIELD_IMAGE_H_

#include "main.h"
#include "object.h"

//*****************************************************************************
//  constant
//*****************************************************************************

//*****************************************************************************
//  class
//*****************************************************************************
class TileField;
class TileFieldImage : public Object{
public:

	//*****************************************************************************
	//【コンストラクタ】
	//*****************************************************************************
	TileFieldImage(Renderer *master_renderer, int layer_no = Object::DRAW_LAYER_INSTANCING_MESH);

	//*****************************************************************************
	//【デス様】
	//*****************************************************************************
	virtual ~TileFieldImage();

	//*****************************************************************************
	//【初期化】
	//  まだ引数が確定しないんだが、どうせownerだけで終わり
	//*****************************************************************************
	HRESULT SetUp(TileField* owner);

	//*****************************************************************************
	//【終了】
	//*****************************************************************************
	void Release(void);

	//*****************************************************************************
	//【更新】
	//*****************************************************************************
	virtual void Update(void);

	//*****************************************************************************
	//【描画】
	//*****************************************************************************
	virtual void Draw(void);

	//インスタンシング用バッファーの中身を現在のownerの状態に更新する
	void CommitImage(void);

	//accessor
	void SetWireFrameFlag(bool value){ _wire_frame = value; }
protected:
	static const int IMAGE_MAX = 1;
	int _image_id[IMAGE_MAX];
	bool _transparent;
	bool _wire_frame;
	TileField* _owner;

	LPDIRECT3DVERTEXBUFFER9 _world_buffer;
	LPDIRECT3DVERTEXDECLARATION9 _world_decl;
	D3DXATTRIBUTERANGE* _attribute;


	void DrawImage(D3DXVECTOR3 position, D3DXVECTOR3 size);
};

//accessor

#endif//_SCENE_X_H_